Repository: BRDK-GitHub/vibratorExampleProject
Catalog: Logical/mappView/Visualization/Dialogs/dialogConfirmCancel/dialogConfirmCancelStates.tmx
Source language: en
Languages: cs, hu, vi, zh

source: Confirm reboot PLC
cs: Potvrdte mekky restart.
hu: Erősítse meg a PLC újraindítását
vi: Xác nhận khởi động lại PLC
zh: 请重启PLC

source: Confirm reteach brick
cs: Potvrdte opakovani nacteni capconu
hu: Erősítse meg a tégla újratanításást
vi: Xác nhận khối gạch hướng dẫn lại
zh: 确认重新示教元件

source: Please confirm that all parts will be stopped and only circular vibrator can be used during linearization
cs: Prosim potvrdte ze vsechno bude zastaveno a jen kruhovy vibr.podavac bude pouzit na linearizaci
hu: Kérjük, erősítse meg, hogy minden alkatrész leáll, és a linearizálás során csak körkörös vibrátor használható
vi: Vui lòng xác nhận rằng tất cả các bộ phận sẽ bị dừng và chỉ có thể sử dụng máy rung tròn trong quá trình tuyến tính hóa
zh: 请确认在线性整定期间所有部件将停止并且只有圆形振动盘可用

source: Please confirm that all parts will be stopped and only linear vibrator can be used during linearization
cs: Prosim potvrdte ze vsechno bude zastaveno a jen linearni vibr.podavac bude pouzit na linearizaci
hu: Kérjük, erősítse meg, hogy minden alkatrész leáll, és a linearizálás során csak lineáris vibrátor használható
vi: Vui lòng xác nhận rằng tất cả các bộ phận sẽ bị dừng và chỉ có thể sử dụng máy rung tuyến tính trong quá trình tuyến tính hóa
zh: 请确认在线性整定期间所有部件将停止并且只有线性振动盘可用

source: Please confirm factory reset of all configuration parameters
cs: Potvrďte prosím tovární nastavení všech konfiguračních parametrů
hu: Kérjük, erősítse meg az összes konfigurációs paraméter gyári visszaállítását
vi: Vui lòng xác nhận khôi phục cài đặt gốc của tất cả các thông số cấu hình
zh: 请确认是否将所有参数恢复到初始设置。

source: Current configuration will overwrite the existing on HMI panel.\nConfirm that you want to proceed.
cs: Aktuální konfigurace přepíše existující na panelu HMI.\n Potvrďte, že chcete pokračovat.
hu: Az aktuális konfiguráció felülírja a HMI-panelen meglévő konfigurációt.\nErősítse meg, hogy folytatni kívánja.
vi: Cấu hình hiện tại sẽ ghi đè lên cấu hình hiện có trên bảng HMI.\nXác nhận rằng bạn muốn tiếp tục.
zh: 当前设置将覆盖屏幕上已有参数。\n请确认是否继续？

source: Please confirm to change item quantity from {@main.opcItemQuantity} to {$IAT/dialog/confirmCancel/states/sesItemQuantity}.
cs: Prosim potvrdte zmenu mnozstvi {@main.opcItemQuantity} -> {$IAT/dialog/confirmCancel/states/sesItemQuantity}.
hu: Kérjük, erősítse meg, hogy a tétel mennyisége {@main.opcItemQuantity}-ről {$IAT/dialog/confirmCancel/states/sesItemQuantity}-re módosuljon.
vi: Vui lòng xác nhận thay đổi số lượng mặt hàng từ {@main.opcItemQuantity} thành {$IAT/dialog/confirmCancel/states/sesItemQuantity}.
zh: 请确认更改项目数量从 {@main.opcItemQuantity} -> {$IAT/dialog/confirmCancel/states/sesItemQuantity}.

# Confirm update of CM20 to version: {@dialog.updateVersion}
source: Confirm update of CM20 to version: \n\n{@dialog.updateVersion}
cs: Potvrďte aktualizaci CM20 na verzi: \n\n{@dialog.updateVersion}
hu: A CM20 verzió frissítésének megerősítése: \n\n{@dialog.updateVersion}
vi: Xác nhận cập nhật CM20 lên phiên bản: \n\n{@dialog.updateVersion}
zh: 确认更新 CM20 到版本： \n\n{@dialog.updateVersion}

source: Please confirm that the existing recipe will be overwritten with the current machines parameters.
vi: Vui lòng xác nhận rằng công thức hiện có sẽ được ghi đè bằng các thông số máy hiện tại.
zh: 请确认配方参数将被当前设备参数覆盖

# Confirm update of LINE to version: {@dialog.updateVersion}
source: Confirm update of LINE to version: \n\n{@dialog.updateVersion}
vi: Xác nhận cập nhật LINE lên phiên bản: \n\n{@dialog.updateVersion}
